src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/РасчётСкидок/Ext/Module.bsl
// Область содержит экспортные методы расчётной подсистемы скидок и цен:
// расчёт итогового процента скидки клиента, применение скидки ко всем строкам товаров документа продажи
// и получение актуальной цены номенклатуры по виду цены на заданную дату.
#Область ПрограммныйИнтерфейс

// Рассчитывает итоговый процент скидки для клиента с учётом базовой ставки договора,
// VIP-статуса контрагента, превышения порога суммы заказа и сезонной акции.
//
// Параметры:
//  Клиент       - СправочникСсылка.Партнёры - контрагент, для которого рассчитывается скидка.
//  Договор      - СправочникСсылка.ДоговорыКонтрагентов - договор, из которого берётся базовая ставка дисконтирования.
//  СуммаЗаказа  - Число - сумма заказа клиента, используется для проверки порога крупного заказа.
//  ДатаЗаказа   - Дата - дата заказа, используется для проверки действия сезонной акции.
//
// Возвращаемое значение:
//  Число - итоговый процент скидки (от 0 до значения константы МаксимальнаяСкидкаПоУмолчанию).
//
// Пример:
//  ПроцентСкидки = РасчётСкидок.РассчитатьСкидку(Клиент, Договор, 150000, ТекущаяДата());
//
Функция РассчитатьСкидку(Клиент, Договор, СуммаЗаказа, ДатаЗаказа) Экспорт

	Скидка = ПолучитьБазовуюСкидку(Договор);

	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Клиент, "VIP") Тогда
		Скидка = Скидка + 5;
	КонецЕсли;

	Если СуммаЗаказа > 100000 Тогда
		Скидка = Скидка + 5;
	КонецЕсли;

	Если ПроверитьУсловиеАкции(ДатаЗаказа) Тогда
		Скидка = Скидка + 3;
	КонецЕсли;

	Возврат ОграничитьМаксимальнуюСкидку(Скидка);

КонецФункции

// Применяет рассчитанную скидку ко всем строкам табличной части "Товары" документа,
// пересчитывает суммы скидок и итоговую сумму документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ продажи (например, ЗаказКлиента, РеализацияТоваровУслуг),
//                   содержащий табличную часть "Товары" с колонками Сумма, ПроцентСкидки, СуммаСкидки,
//                   а также реквизиты Контрагент, Договор, СуммаДокумента, Дата.
//
// Пример:
//  РасчётСкидок.ПрименитьСкидкуКДокументу(ДокументОбъект);
//
Процедура ПрименитьСкидкуКДокументу(ДокументОбъект) Экспорт

	Если ДокументОбъект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПроцентСкидки = РассчитатьСкидку(
		ДокументОбъект.Контрагент,
		ДокументОбъект.Договор,
		ДокументОбъект.СуммаДокумента,
		ДокументОбъект.Дата);

	Для Каждого СтрокаТовара Из ДокументОбъект.Товары Цикл
		СтрокаТовара.ПроцентСкидки = ПроцентСкидки;
		СтрокаТовара.СуммаСкидки = СтрокаТовара.Сумма * ПроцентСкидки / 100;
		СтрокаТовара.Сумма = СтрокаТовара.Сумма - СтрокаТовара.СуммаСкидки;
	КонецЦикла;

	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");

КонецПроцедуры

// Возвращает актуальную цену номенклатуры по указанному виду цены на заданную дату
// из регистра сведений ЦеныНоменклатуры (срез последних).
//
// Параметры:
//  Номенклатура     - СправочникСсылка.Номенклатура - позиция, для которой запрашивается цена.
//  ВидЦены          - СправочникСсылка.ВидыЦен - вид цены, по которому ведётся поиск.
//  ДатаАктуальности - Дата - дата, на которую определяется срез последних. По умолчанию ТекущаяДата().
//
// Возвращаемое значение:
//  Число - значение цены или 0, если запись в регистре не найдена.
//
// Пример:
//  Цена = РасчётСкидок.ПолучитьАктуальнуюЦену(Номенклатура, ВидЦены);
//
Функция ПолучитьАктуальнуюЦену(Номенклатура, ВидЦены, ДатаАктуальности = Неопределено) Экспорт

	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата,
		|		Номенклатура = &Номенклатура
		|		И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";

	Запрос.УстановитьПараметр("Дата", ДатаАктуальности);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);

	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Цена;
	КонецЕсли;

	Возврат 0;

КонецФункции

#КонецОбласти

// Область содержит вспомогательные функции расчёта скидки: чтение базовой ставки из договора,
// проверка действия сезонной акции и ограничение итогового процента скидки допустимым диапазоном.
// Используются только внутри модуля и не предназначены для вызова извне.
#Область СлужебныеПроцедурыИФункции

// Возвращает базовую ставку дисконтирования из реквизита договора, либо 0, если значение не задано.
//
// Параметры:
//  Договор - СправочникСсылка.ДоговорыКонтрагентов - договор, у которого читается реквизит СтавкаДисконтирования.
//
// Возвращаемое значение:
//  Число - базовая ставка скидки в процентах.
//
Функция ПолучитьБазовуюСкидку(Договор)

	БазоваяСкидка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "СтавкаДисконтирования");

	Если БазоваяСкидка = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Возврат БазоваяСкидка;

КонецФункции

// Проверяет, действует ли сезонная акция на дату заказа (декабрь — месяц действия акции).
//
// Параметры:
//  ДатаЗаказа - Дата - дата, на которую проверяется условие акции.
//
// Возвращаемое значение:
//  Булево - Истина, если дата приходится на месяц проведения акции.
//
Функция ПроверитьУсловиеАкции(ДатаЗаказа)

	Если Месяц(ДатаЗаказа) = 12 Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

// Ограничивает значение скидки сверху константой МаксимальнаяСкидкаПоУмолчанию и снизу нулём.
//
// Параметры:
//  Скидка - Число - исходное значение процента скидки.
//
// Возвращаемое значение:
//  Число - значение скидки в допустимом диапазоне [0; МаксимальнаяСкидкаПоУмолчанию].
//
Функция ОграничитьМаксимальнуюСкидку(Скидка)

	МаксимальнаяСкидка = Константы.МаксимальнаяСкидкаПоУмолчанию.Получить();

	Если Скидка > МаксимальнаяСкидка Тогда
		Возврат МаксимальнаяСкидка;
	КонецЕсли;

	Если Скидка < 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Скидка;

КонецФункции

#КонецОбласти
